docs: .md ajustados e atualizados com o projeto atual
